#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```terraform

aws_internet_gateway.igw: Refreshing state... [id=igw-078f303e3b5f1ddbe]
data.aws_iam_policy.AdministratorAccess: Reading...
aws_ecr_repository.conquer-ecr-repo: Refreshing state... [id=dev-conquer-ecr-repo]
aws_iam_openid_connect_provider.gh-idp: Refreshing state... [id=arn:aws:iam::014630368052:oidc-provider/token.actions.githubusercontent.com]
aws_vpc.conquer-vpc: Refreshing state... [id=vpc-080a377054fdb71a7]
aws_default_route_table.vpc_default_rt: Refreshing state... [id=rtb-0f0ece682af7b3018]
aws_iam_role.gh-actions: Refreshing state... [id=gh-actions-role]
data.aws_iam_policy.AdministratorAccess: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.AdministratorAccess: Refreshing state... [id=gh-actions-role-20231015223733555600000001]
aws_route53_zone.private-zone: Refreshing state... [id=Z00046993KENG8WFJDVIG]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_default_route_table.vpc_default_rt will be destroyed
  # (because aws_default_route_table.vpc_default_rt is not in configuration)
  - resource "aws_default_route_table" "vpc_default_rt" {
      - arn                    = "arn:aws:ec2:eu-north-1:014630368052:route-table/rtb-0f0ece682af7b3018" -> null
      - default_route_table_id = "rtb-0f0ece682af7b3018" -> null
      - id                     = "rtb-0f0ece682af7b3018" -> null
      - owner_id               = "014630368052" -> null
      - propagating_vgws       = [] -> null
      - route                  = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-078f303e3b5f1ddbe"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags                   = {
          - "Name" = "dev-conquer-vpc-default-rt"
        } -> null
      - tags_all               = {
          - "Name"    = "dev-conquer-vpc-default-rt"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - vpc_id                 = "vpc-080a377054fdb71a7" -> null
    }

  # aws_ecr_repository.votingapp-ecr-repo will be created
  + resource "aws_ecr_repository" "votingapp-ecr-repo" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "votingapp"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_internet_gateway.igw will be destroyed
  # (because aws_internet_gateway.igw is not in configuration)
  - resource "aws_internet_gateway" "igw" {
      - arn      = "arn:aws:ec2:eu-north-1:014630368052:internet-gateway/igw-078f303e3b5f1ddbe" -> null
      - id       = "igw-078f303e3b5f1ddbe" -> null
      - owner_id = "014630368052" -> null
      - tags     = {
          - "Name" = "dev-conquer-vpc-igw"
        } -> null
      - tags_all = {
          - "Name"    = "dev-conquer-vpc-igw"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - vpc_id   = "vpc-080a377054fdb71a7" -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @leohauschild, Action: `pull_request`, Working Directory: ``, Workflow: `infrastructure`*